{
	"_notes": {
		"_writing": "Xonok"
	},
	"archivist_samples": {
		"name": "archivist_samples",
		"title": "Bringing Samples",
		"desc_short": "Bring rare items.",
		"icon": "img/phase_vapor.webp",
		"agent": "Ancient Archivist",
		"potential": {
			"completed_quests": []
		},
		"start_location": "Precursor Study",
		"start_text": "You enter a humongous room full of weird and exotic objects. In the middle of the room is a pedestal, on it is an old and primitive-looking robot. It greets you with an inhumanly pitch-perfect voice: 'Greetings, traveller. I am Xzx5870, a fifth generation Interactive Encyclopedia on the topic of the Ancients. Are you here to assist with research? Yes/No.'\nAfter asking what's an encyclopedia and receiving a definition, you affirm that yes, you are indeed interested in the job, although you don't know what exactly you'd have to do.\nAs it answers, the robot begins to slowly drive toward you and the edge of the pedestal it's on.\n'Simple. Receive instructions, bring required items. Reward: credits and access to lectures.'\nIt states and falls off of the pedestal. Crashing into the floor makes several bits and pieces fly off and severely dents one side of the robot.\nIt tries to continue the conversation, but its voice is now distorted:\n'Do yOu ☆acCePT_ workx/zzz job?'",
		"start_img": "img/birthday_cake.webp",
		"outcomes": [
			{
				"name": "success",
				"objectives": {
					"location": "Precursor Study",
					"items": {
						"exotic_matter": 5,
						"phase_vapor": 5,
						"storm_shards": 5,
						"mosaic": 5
					}
				},
				"rewards": {
					"items": {
						"dragon_egg": 1
					}
				},
				"objectives_text": [
					"Return to Precursor Study.",
					"Deliver Exotic Matter: 5",
					"Deliver Phase Vapor: 5",
					"Deliver Storm Shards: 5",
					"Deliver Mosaic: 5"
				],
				"end_text": "As you return you see that half of the robot's head has been replaced with a device of some sort.\nFinding replacement parts is difficult for a machine this old.\nIt picks up a random crate and places it in front of you:\n'Your rewar-r-=-r-dd. Lecture passwords will be transmitted to your ship shortly.'",
				"end_img": "img/dragon_egg.webp"
			}
		]
	}
}