{
	"_notes": {
		"_concept": "Xonok",
		"_writing": "RobbyLAVA"
	},
	"mite_extermination": {
		"name": "mite_extermination",
		"title": "Mites, in space...?",
		"desc_short": "Fight weak mites.",
		"icon": "img/cute_dude.webp",
		"agent": "Officer Brax",
		"potential": {
			"completed_quests": []
		},
		"start_location": "Forge",
		"start_text": "G'day to you, the name is Post Officer-Laureate Braxton Gaunnessey - you can call me Brax. But no time for formalities: is that tin can of yours fit for combat? I got a fireteam out in yon Asteroid Belt needing backup, stat!\nA whole spawn cluster of Mites has been up our bungholes for the past few weeks. We deployed to stop 'em chewing up the ore refineries out there, but you know how Mites are - just kept multiplying. Worse still, the buggers got one of our two ships, and when I evac'ed to get help the upper brass said we're on our own.\nI'm begging you, you gotta save my boys. We aren't well-funded out here, but I'll make it up to you however I can. Maybe put in a good word for you to the supes if you wanna freelance in these parts. Whaddya say?",
		"outcomes": [
			{
				"name": "success",
				"objectives": {
					"location": "Forge",
					"targets_killed": [
						{
							"name": "creature_mite",
							"amount": 6
						}
					]
				},
				"rewards": {
					"credits": 2000
				},
				"objectives_text": [
					"Buy and equip a coilgun, a light armor, and a barrier alpha.(if you don't already have them)",
					"Kill 6 mites.",
					"Return to Officer Brax at Forge."
				],
				"end_text": "You're back! And with the lads in tow! Well jettison my breakfast, I can't believe you pulled it off! This calls for a celebration - Chrum my man, put an order in to the Corrie Tavern, let's have drinks all around!\nI'll always remember what you've done for me this day. These blokes are the closest stuff to family I have these days. Are you planning on sticking 'round these parts? If so, we could use you - I got my team back but we're down a ship, and resupply takes ages out here... they keep saying it's a paperwork issue."
			}
		]
	},
	"mite_slaughter": {
		"name": "mite_slaughter",
		"title": "Bigger Mites",
		"desc_short": "Fight stronger mites.",
		"icon": "img/mite_big.webp",
		"agent": "Officer Brax",
		"potential": {
			"completed_quests": [
				"mite_extermination"
			]
		},
		"start_location": "Forge",
		"start_text": "Aha, the exterminator is back! Just the hiver I need right now. Did you know that Mites come in multiple sizes? Well neither did I, until about 2 hours ago: there's a resupply convoy coming in - about damn time - so we went out to clear the way. But up by the Asteroid Belt, the boys and I caught a glimpse of the biggest Mite I've ever seen - huge chompers, hide like Plasteel, the works. Looked like my mother-in-law.\nThat's where you come in. Half the reason we can't tango with those things right now is cuz we haven't been resupplied in an engine's age, and if they take out the convoy then we are well and truly scuppered. How about it? I'll be able to pay you a bit better than last time too.",
		"outcomes": [
			{
				"name": "success",
				"objectives": {
					"location": "Forge",
					"targets_killed": [
						{
							"name": "creature_mite_big",
							"amount": 3
						}
					]
				},
				"rewards": {
					"credits": 5000
				},
				"objectives_text": [
					"Destroy 3 big mites.",
					"Return to Officer Brax at Forge."
				],
				"hints": [
					"Visit Trade tab for an extra weapon, shield, or armor."
				],
				"end_text": "When the convoy came in without you I thought we had lost you, gave me a right heart attack. But I shoulda known better - you really are one hell of an exterminator.\nI haven't been this happy to see a convoy since I was out in the warzones. I talked to their chief navigator, apparently them bigger mites bunk up near asteroids since they can't get enough food from passing ships. That's not too surprising, but unfortunately it also probably means we have a nest on our hands somewhere..."
			}
		]
	},
	"mite_nest": {
		"name": "mite_nest",
		"title": "A Mite Nest!? [HARD]",
		"desc_short": "Challenge yourself.",
		"icon": "img/mite_nest.webp",
		"agent": "Officer Brax",
		"potential": {
			"completed_quests": [
				"mite_slaughter"
			]
		},
		"start_location": "Forge",
		"start_text": "Thank my blasted stars, you're still about! Exactly the hiver I need right now. We've been running some recon since the rescue operation - Mite spawn clusters don't just pop outta nowhere, and we've managed to track down the Nest that last one radiated from.\nA couple weeks ago the coretapping operation on the moon Shuckwart IX went quiet. Well, we now know why: completely overtaken by Mites. Those big drills, processing plants, and ingot vaults have probably been breakfast, lunch, and dinner to a couple dozen Mite generations already, but that'll climb to hundreds unless we do something quick.\nWhaddya say, ace? You've clocked some good practice against Mites already, and I don't think my boys and I can put a stop to this with just one ship.",
		"outcomes": [
			{
				"name": "success",
				"objectives": {
					"location": "Forge",
					"targets_killed": [
						{
							"name": "creature_mite_nest",
							"amount": 1
						}
					]
				},
				"rewards": {
					"credits": 30000
				},
				"objectives_text": [
					"Destroy the Mite Nest further south.",
					"Return to Officer Brax at Forge."
				],
				"end_text": "Good shooting there, ace! Cook my cakes, I thought that'd be harder than it was.\nI wrote up my report to the supes on the way back: put in more than a few good words for you. Don't be surprised if they come a-knocking with some fat commissions for you? The brass know I have an eye for talent - 'When Brax says someone's the tops, we listen,' they always say.\nOh, I finally got word that I'm getting a second ship, so us professionals should have the Mites under control from here. But I got plenty more for you to do besides... all above board, of course (nervous cough)."
			}
		]
	},
	"weapon_shipment": {
		"name": "weapon_shipment",
		"title": "Weapon Shipment",
		"desc_short": "Bring a good laser.",
		"icon": "img/gatling_laser.webp",
		"agent": "Officer Brax",
		"potential": {
			"completed_quests": [
				"mite_nest"
			]
		},
		"start_location": "Forge",
		"start_text": "Oh 'ey, it's you ace... Listen, just between you 'n' me, this job ain't easy. We still haven't had that resupply in yet, y'know, and you can bet your blasters that we need it. Badly. Firepower's in short supply, and if we don't get some heavier ordnances on deck then... well, I dunno what'll happen. Nothin' good, I'd wager.\nCan I trust you to keep a secret, ace? A buddy of mine out on Megrez has something for me. Quite possibly a solution to all our issues: a Gatling Laser. Thing is... well, there's no sugarcoating it, he's nonmilitary. Truth be told, I dunno how he even got the damn thing. And if I'm seen purchasing heavy weaponry off of civilians... not a good look, y'know?\nThink you could grab it for me, mate? Megrez ain't far, and you're one of the few people I trust with such a sticky task at this point... I hate that it's come to this.",
		"outcomes": [
			{
				"name": "success",
				"objectives": {
					"location": "Forge",
					"items": {
						"gatling_laser": 1
					}
				},
				"rewards": {
					"credits": 20000
				},
				"objectives_text": [
					"Travel to Megrez Prime in Megrez.",
					"Buy a Gatling Laser.",
					"Return to Officer Brax at Forge."
				],
				"end_text": "Did you get it? Do you have it?... No?... Oooohoho, you really had me sweating there, you dog! Should've known it wouldn't be a problem for you, ace. Did anyone see you? Do you know if you were followed?\n... Alright, alright, I'll cool it. But you keep your eyes peeled, ok? Don't want you to get tangled up in a court martial case; I sure as fission don't want to either.\nI owe you, ace. Again. Feel like I'm saying that a lot lately... Anyway, lemme just take this little beauty off your hands, recomp you, and send you on your merry way. Unless you got time to have a drink with me 'n' the boys first!"
			}
		]
	},
	"shield_shipment": {
		"name": "shield_shipment",
		"title": "Shield Shipment",
		"desc_short": "Bring a good shield.",
		"icon": "img/barrier_beta.webp",
		"agent": "Officer Brax",
		"potential": {
			"completed_quests": [
				"weapon_shipment"
			]
		},
		"start_location": "Forge",
		"start_text": "Y'ever heard the phrase 'The best defense is a good offense', Ace? Well whoever said it was a right moron. Probably had a dog named cat and ate his dinner first thing in the morning.\nI'll be straight with you mate, I thought the Gatling Laser would fix our problems but it hasn't. Mites at our doorstep day after day, and no matter what we do there's a little less doorstep left afterwards.\nYou remember my associate on Megrez?... Yeah, with the ugly goatee, that guy. Well he's got another special delivery for me ready, this time a state of the art Barrier Beta. Eons only know where he got the damn thing from. Says it fell off a truck. Megrez doesn't even have roads!\nI promise you, Ace, I'll never ask for your help again if you can go pick up that Barrier for me. You know I'm good for my word, I'll recomp you fair and square even if it drains my last couple credits to do so.",
		"outcomes": [
			{
				"name": "success",
				"potential": {
					"moved": true
				},
				"objectives": {
					"location": "Forge",
					"items": {
						"barrier_beta": 1
					}
				},
				"rewards": {
					"credits": 25000
				},
				"objectives_text": [
					"Travel to Megrez Prime in Megrez.",
					"Buy a Barrier Beta.",
					"Return to Officer Brax at Forge."
				],
				"end_text": "You couldn't have come at a better time, Ace. Let's get that Barrier deployed... There! Ha! Suck sewage, you pestilential pains-in-my-arse! See how they're trying to bite through? Hardlight's a bit tougher to chew on then my spaceport!\nAce, I thought I had run out of luck years ago, but things are looking up for this ol' boy at long last. Hit me up anytime you're in the area and you'll have a comfortable bed, three hot meals a day, and unlimited drinks all on the house. Least I can do to thank you for everything.\nBut food and drink are cheap, I've got something better for you. Something came in just before you arrived - you've been offered an official position as a privateer! Didn't I tell you? When I say someone's the tops, they listen.\nSo let's go celebrate! Between the barrier and your promotion, I see good times on the horizon for you and me both."
			},
			{
				"name": "success",
				"potential": {
					"moved": false
				},
				"objectives": {
					"location": "Forge",
					"items": {
						"barrier_beta": 1
					}
				},
				"rewards": {
					"credits": 25000
				},
				"objectives_text": [
					"Travel to Megrez Prime in Megrez.",
					"Buy a Barrier Beta.",
					"Return to Officer Brax at Forge."
				],
				"end_text": "So when are you headed out to Megrez? Not to rush you, but we really- Wait... is that a <b>Barrier Alpha</b>?! For <i>ME</i>?!\n... I'm speechless. You're a mind reader! How in the cosmos did you know that I would need one of these?! Did you get it from my guy on Megrez? Well this settles it, you really are good at this whole privateering business!\nOh, speaking of which, almost forgot: an official privateering commission came in for you while you were out. You'll get some good commissions from that if you take them up on it!\nJust don't forget your old pal Brax when you're all famous and successful, okay? You come back here anytime you like and we'll have a whole comfy crash pad put together for you, free of charge."
			}
		]
	}
}