{
	"skyrmex": "Common name: Skyrmex (pl. Skyrmeces)\n\nOriginally derived from ant-like creatures many thousands of years ago, the result of a long-running genetic experiment by a now dead civilization to artificially create animals that could survive in vacuums.\nTheir exoskeletons are paper thin and their insides are largely made sturdy elastic structures, allowing them to survive in outer space but also meaning they are much larger than comparable creatures, often as large as a real world car.\nSubsist largely on the gases of nebulae , which also carry trace minerals and essential elements to propagate their biology. Rather than wings, propulsion jets later their backs, which may be articulated like digits and can expel pressurized gases, allowing them to fly at prodigious speeds.\n\nConverting the matter that they need to survive, however, cannot be done by all of their bodies. The colonies Queen is the only of its members that can do so, all of her bodily processes evolved solely for the purposes of producing spawn and transmuting space gases into digestible products for her drones. These Queens are massive creatures, sometimes resembling small space stations, whose bodies are full of specialized cavities and organs serving to sustain and multiply the hive.\n\nWhen the hive detects insurmountable danger or dwindling resources, the queen will stock up on supplies before her drones will push her through space to a new location. Skyrmex do not have any sensory organs besides a specialized lobe that allows them to detect and differentiate radiation, which they can do over hundreds of parsecs to pick out new potential food sources and, on a closer scale, identify potential threats\nQueens and drones also emit unique radiation signatures that all members of their hive know, allowing individuals to be identified and rival hives to immediately be spotted as threats.\n\nThe radiation given off by these creatures allows them to actively disrupt electromagnetics. If they sense an enemy, such as a spaceship, moving inbound with such devices aboard, they will come together in ordered formations, moving in perfect tandem to instinctively jam and disrupt everything from communication devices to scanners.\n\nWhen attacking a vessel, they make use of specialty attack drones (colloquially called 'Punchers') armed with a piston powered rostrum that, after a few tries, can punch through even the toughest hulls.\nEnergy Shields can also be disrupted by other specialty drones ('Buzzers') who have an extra dose of radiation as well as intricate frills along their limbs that allows them to roughly and instinctually manipulate it to some degree, allowing for targeted interference with more sophisticated and practical energetic systems.\nNormally they just have to break open a hull in a couple right places for a ship to be compromised as the vacuum of space does the rest of the work. And more dramatic cases, however, the high will send in another type of specialty drone ('Dynas'). These are strange, hulking creatures with a bloated appearance and many more jet propulsion structures.\nDynas have an even higher top speed than normal drones but are quite fragile. Once they instinctively detect that they are close to an enemy, however, they will violently explode, their internal chemistry concocting a minor nuclear fission that results in a dramatic explosion approaching the power of an early atomic bomb.\nThe vacuum of space does somewhat curb this destructive power, but it is still among the most devastating natural weapons that any known alien creature has evolved. And though the first Skyrmeces where artificially created, all of the biological weapons they have developed have come about through millennia of rapidly iterative evolution.\n\nThey have multiplied and spread to such a degree that virtually everywhere there are nebulae, at least a small colony of Skyrmeces can inevitably be found.\nIn the rare cases where one of their Queens can be taken hostage and her internal drone producing mechanisms can be disabled or destroyed, the natural gas and mineral refinement she can provide en masse can rival even some smaller industrial harvesting operations and with a fraction of the upkeep cost.\nHer eggs and some other body parts also can sell for decent money at some unscrupulous laboratories, as Skyrmex biology is claimed by some to hold the future of space travel and resource extraction.\n"
}